BAS BMEKZU Project/src/Documents/ЗаявлениеНаПрименениеЛьготы/ЗаявлениеНаПрименениеЛьготы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявлениеНаПрименениеЛьготы</name>
  <basedOn>Document.ПриемНаРаботу</basedOn>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.ИНАГРО_ПриемНаРаботуВОрганизацию</basedOn>
  <registerRecords>InformationRegister.ЛьготыПоНДФЛСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Работники</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Льгота</name>
      <type>
        <types>CatalogRef.ВидыЛьготПоНДФЛ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Актуальность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНАГРО_Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/InformationRegisters/ЛьготыПоНДФЛСотрудников/ЛьготыПоНДФЛСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛьготыПоНДФЛСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Льгота</name>
    <type>
      <types>CatalogRef.ВидыЛьготПоНДФЛ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИНАГРО_Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Documents/ЗаявлениеНаПрименениеЛьготы/ObjectModule.bsl
#Если Не ТолстыйКлиентУправляемоеПриложение Или Сервер Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Подсистема "Управление доступом"

Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "Работники.ФизическоеЛицо");
	
КонецПроцедуры

// Подсистема "Управление доступом"

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриемНаРаботу") Тогда
		НоваяСтрока = ЭтотОбъект.Работники.Добавить();
		НоваяСтрока.ФизическоеЛицо = ДанныеЗаполнения.Сотрудник.ФизическоеЛицо;
		НоваяСтрока.ДатаИзменения = ДанныеЗаполнения.ДатаПриема;
		НоваяСтрока.Актуальность = ИСТИНА;
		БазоваяЛьгота = Справочники.ВидыЛьготПоНДФЛ.НДФЛ_611;
		НоваяСтрока.Льгота = БазоваяЛьгота;
		Организация = ДанныеЗаполнения.Организация;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда 
		НоваяСтрока = ЭтотОбъект.Работники.Добавить();
		НоваяСтрока.ФизическоеЛицо = ДанныеЗаполнения.Ссылка.ФизическоеЛицо;
		НоваяСтрока.Актуальность = ИСТИНА;
		
		СписокСотрудников = Новый СписокЗначений;
		СписокСотрудников.Добавить( ДанныеЗаполнения.Ссылка);
		СтрокаКадровыеДанные = "ДатаПриема";
		ДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, СтрокаКадровыеДанные, Дата);
		Если НЕ ДанныеСотрудника[0].ДатаПриема = Дата('00010101') Тогда
			ДатаПриема = ДанныеСотрудника[0].ДатаПриема;	
			НоваяСтрока.ДатаИзменения = ДатаПриема;
		КонецЕсли;	
		
		БазоваяЛьгота = Справочники.ВидыЛьготПоНДФЛ.НДФЛ_611;
		НоваяСтрока.Льгота = БазоваяЛьгота;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Инагро_ПриемНаРаботуВОрганизацию") Тогда // ИНАГРО
		
		ДокументОснование = ДанныеЗаполнения;
		Организация       = ДанныеЗаполнения.Организация;
		
		Для Каждого СтрокаОснования Из ДанныеЗаполнения.РаботникиОрганизации Цикл
			
			СтрокаРаботники = ЭтотОбъект.Работники.Добавить();			
			СтрокаРаботники.ИНАГРО_Сотрудник = СтрокаОснования.Сотрудник;
			СтрокаРаботники.Льгота           = Справочники.ВидыЛьготПоНДФЛ.НДФЛ_611;
			СтрокаРаботники.ДатаИзменения    = СтрокаОснования.ДатаПриема;
			СтрокаРаботники.Актуальность     = Истина;
			
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	ДанныеДляПроведения = ПолучитьДанныеДляПроведения();
	
	Если ДанныеДляПроведения.Количество() > 0 Тогда
		Движения.ЛьготыПоНДФЛСотрудников.Записывать = Истина;
	КонецЕсли; 
	
	ДанныеДляПроведения.Колонки.ДатаИзменения.Имя = "Период";
	Движения.ЛьготыПоНДФЛСотрудников.Загрузить(ДанныеДляПроведения);
	
	Если ДополнительныеСвойства.Свойство("ОтключитьПроверкуДатыЗапретаИзменения")
		И ДополнительныеСвойства.ОтключитьПроверкуДатыЗапретаИзменения Тогда
		
		Движения.ЛьготыПоНДФЛСотрудников.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
Функция  ПолучитьДанныеДляПроведения()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗаявлениеРаботники.Ссылка.Организация КАК Организация,
	               |	ЗаявлениеРаботники.Ссылка.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	               |	ЗаявлениеРаботники.ИНАГРО_Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	ЗаявлениеРаботники.Льгота КАК Льгота,
	               |	ЗаявлениеРаботники.ДатаИзменения КАК ДатаИзменения,
	               |	ЗаявлениеРаботники.Актуальность КАК Актуальность,
	               |	ЗаявлениеРаботники.ИНАГРО_Сотрудник
	               |ИЗ
	               |	Документ.ЗаявлениеНаПрименениеЛьготы.Работники КАК ЗаявлениеРаботники
	               |ГДЕ
	               |	ЗаявлениеРаботники.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗаявлениеРаботники.Актуальность УБЫВ,
	               |	ЗаявлениеРаботники.ФизическоеЛицо.Наименование";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецЕсли
